---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.FluidViscosity
source: html/113a91e4-34c4-d551-d401-d63c9699502e.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.FluidViscosity Property

The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).

## Syntax (C#)
```csharp
public double FluidViscosity { get; }
```